In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
df = pd.read_csv('tips.csv')

In [ ]:
df.head()

   total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0       16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1       10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2       21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3       23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4       24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251

[5 rows x 11 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [ ]:
df['CC Number'] = df['CC Number'].apply(lambda x: str(x)[-4:])

In [ ]:
df['CC Number']

0      3410
1      9230
2      1322
3      5994
4      7221
       ...
239    2842
240    5404
241    7196
242    0950
243    8139
Name: CC Number, Length: 244, dtype: object

In [ ]:
def quality(total_bill,tip):
  if tip/total_bill > 0.25:
    return 'Generous'
  return 'Other'

In [ ]:
#1st method
df['Quality'] = df[['total_bill','tip']].apply(lambda df: quality(df['total_bill'],df['tip']),axis=1)

In [ ]:
df.head()

   total_bill   tip     sex  ... CC Number Payment ID Quality
0       16.99  1.01  Female  ...      3410    Sun2959   Other
1       10.34  1.66    Male  ...      9230    Sun4608   Other
2       21.01  3.50    Male  ...      1322    Sun4458   Other
3       23.68  3.31    Male  ...      5994    Sun5260   Other
4       24.59  3.61  Female  ...      7221    Sun2251   Other

[5 rows x 12 columns]

In [ ]:
#2nd method
df['Quality'] = np.vectorize(quality)(df['total_bill'],df['tip'])

In [ ]:
df

     total_bill   tip     sex  ... CC Number Payment ID Quality
0         16.99  1.01  Female  ...      3410    Sun2959   Other
1         10.34  1.66    Male  ...      9230    Sun4608   Other
2         21.01  3.50    Male  ...      1322    Sun4458   Other
3         23.68  3.31    Male  ...      5994    Sun5260   Other
4         24.59  3.61  Female  ...      7221    Sun2251   Other
..          ...   ...     ...  ...       ...        ...     ...
239       29.03  5.92    Male  ...      2842    Sat2657   Other
240       27.18  2.00  Female  ...      5404    Sat1766   Other
241       22.67  2.00    Male  ...      7196    Sat3880   Other
242       17.82  1.75    Male  ...      0950      Sat17   Other
243       18.78  3.00  Female  ...      8139    Thur672   Other

[244 rows x 12 columns]

In [ ]:
import timeit

In [ ]:
#code sinppet to be executed only once
setup = '''
import numpy as np
import pandas as pd
df = pd.read_csv('tips.csv')
def quality(total_bill,tips):
  if tips / total_bill > 0.25:
    return "Generous"
  return "Other"
'''

In [ ]:
#code snippet whose execution time is to be measured
stmt_one = '''
df['Quality'] = df[['total_bill','tip']].apply(lambda df: quality(df['total_bill'],df['tip']),axis=1)
'''
stmt_two = '''
df['Quality'] = np.vectorize(quality)(df['total_bill'],df['tip'])
'''

In [ ]:
timeit.timeit(setup=setup,stmt=stmt_one,number=1000)

4.768359486999998

In [ ]:
timeit.timeit(setup=setup,stmt=stmt_two,number=1000)

0.4137328869999237

In [ ]:
 #1st approach
 df['sex'].replace(['Female','Male'],['F','M'])

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [ ]:
#2nd apporach
mymap = {'Female': 'F', 'Male': 'M'}
df['sex'].map(mymap)

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [ ]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Length: 244, dtype: bool

In [ ]:
simple_df = pd.DataFrame([1,2,2,2],['a','b','c','d'])

In [ ]:
simple_df

   0
a  1
b  2
c  2
d  2

In [ ]:
simple_df.duplicated()

a    False
b    False
c     True
d     True
dtype: bool

In [ ]:
simple_df.drop_duplicates()

   0
a  1
b  2

In [ ]:
df[df['total_bill'].between(10,20,inclusive=True)]

     total_bill   tip     sex  ... CC Number Payment ID Quality
0         16.99  1.01  Female  ...      3410    Sun2959   Other
1         10.34  1.66    Male  ...      9230    Sun4608   Other
8         15.04  1.96    Male  ...      0377    Sun6820   Other
9         14.78  3.23    Male  ...      9786    Sun3775   Other
10        10.27  1.71    Male  ...      1219    Sun2546   Other
..          ...   ...     ...  ...       ...        ...     ...
234       15.53  3.00    Male  ...      1930    Sat7220   Other
235       10.07  1.25    Male  ...      7605    Sat4615   Other
236       12.60  1.00    Male  ...      3965    Sat5032   Other
242       17.82  1.75    Male  ...      0950      Sat17   Other
243       18.78  3.00  Female  ...      8139    Thur672   Other

[130 rows x 12 columns]

In [ ]:
df.nlargest(2,'tip')

     total_bill   tip   sex  ... CC Number Payment ID Quality
170       50.81  10.0  Male  ...      8236    Sat1954   Other
212       48.33   9.0  Male  ...      5212    Sat4590   Other

[2 rows x 12 columns]

In [ ]:
!pip install lxml

Requirement already satisfied: lxml in /usr/local/lib/python3.7/dist-packages (4.2.6)

reading data from html

In [ ]:
url = "https://en.wikipedia.org/wiki/World_population"

In [ ]:
tables = pd.read_html(url)

In [ ]:
tables

[        World population (millions, UN estimates)[14]  ...
                                                     #  ...                                            2030[A]
 0                                                   1  ...                                               1416
 1                                                   2  ...                                               1528
 2                                                   3  ...                                                356
 3                                                   4  ...                                                295
 4                                                   5  ...                                                245
 5                                                   6  ...                                                228
 6                                                   7  ...                                                263
 7                                                   8  ...                                                186
 8                                                   9  ...                                                149
 9                                                  10  ...                                                148
 10                                                NaN  ...                                               8501
 11  Notes: .mw-parser-output .reflist{font-size:90...  ...  Notes: .mw-parser-output .reflist{font-size:90...

 [12 rows x 5 columns],
                   Continent  ...             Most populous city (metropolitan area)
 0                      Asia  ...  37,393,000/13,929,000 – Greater Tokyo Area/Tok...
 1                    Africa  ...                             20,900,000 – Cairo[17]
 2                    Europe  ...  16,855,000/12,537,000 – Moscow metropolitan ar...
 3             Latin America  ...  22,043,000/12,176,000 – São Paulo Metro Area/S...
 4  Northern America[note 2]  ...  23,724,000/8,323,000 – New York metropolitan a...
 5                   Oceania  ...                                 4,925,000 – Sydney
 6                Antarctica  ...                            1,258 – McMurdo Station

 [7 rows x 5 columns],
   World population milestones in billions (Worldometers estimates)  ...
                                                         Population  ...    10
 0                                               Year                ...  2056
 1                                      Years elapsed                ...    19

 [2 rows x 11 columns],
                                                    0                                  1
 0  .mw-parser-output .legend{page-break-inside:av...  67.5–70 65–67.5 60–65 55–60 50–55,
    Rank        Country  ...        Date          Source(official or UN)
 0     1          China  ...  8 Oct 2021   National population clock[89]
 1     2          India  ...  8 Oct 2021   National population clock[90]
 2     3  United States  ...  8 Oct 2021   National population clock[91]
 3     4      Indonesia  ...  1 Jul 2020  National annual projection[92]
 4     5       Pakistan  ...  1 Jul 2020               UN Projection[93]
 5     6         Brazil  ...  8 Oct 2021   National population clock[94]
 6     7        Nigeria  ...  1 Jul 2020               UN Projection[93]
 7     8     Bangladesh  ...  8 Oct 2021   National population clock[95]
 8     9         Russia  ...  1 Jan 2020    National annual estimate[96]
 9    10         Mexico  ...  1 Jul 2020  National annual projection[97]

 [10 rows x 6 columns],
    Rank      Country  Population  Area(km2)  Density(pop/km2)
 0     1    Singapore     5704000        710              8033
 1     2   Bangladesh   171490000     143998              1191
 2     3      Lebanon     6856000      10452               656
 3     4       Taiwan    23604000      36193               652
 4     5  South Korea    51781000      99538               520
 5     6       Rwanda    12374000      26338               470
 6     7        Haiti    11578000      27065               428
 7     8  Netherlands    17640000      41526               425
 8     9       Israel     9410000      22072               426
 9    10        India  1382840000    3287240               421,
    Rank         Country  ...  Density(pop/km2)  Population trend
 0     1           India  ...               421           Growing
 1     2        Pakistan  ...               280   Rapidly growing
 2     3      Bangladesh  ...              1191   Rapidly growing
 3     4           Japan  ...               333     Declining[98]
 4     5     Philippines  ...               370           Growing
 5     6         Vietnam  ...               290           Growing
 6     7  United Kingdom  ...               273           Growing
 7     8     South Korea  ...               520            Steady
 8     9          Taiwan  ...               652            Steady
 9    10       Sri Lanka  ...               332           Growing

 [10 rows x 6 columns],
     Year  Population Yearly growth  ... Density(pop/km2) Urban population
     Year  Population             %  ... Density(pop/km2)           Number    %
 0   1951  2584034261         1.88%  ...               17        775067697  30%
 1   1952  2630861562         1.81%  ...               18        799282533  30%
 2   1953  2677608960         1.78%  ...               18        824289989  31%
 3   1954  2724846741         1.76%  ...               18        850179106  31%
 4   1955  2773019936         1.77%  ...               19        877008842  32%
 ..   ...         ...           ...  ...              ...              ...  ...
 65  2016  7464022000         1.14%  ...               50       4060653000  54%
 66  2017  7547859000         1.12%  ...               51       4140189000  55%
 67  2018  7631091000         1.10%  ...               51       4219817000  55%
 68  2019  7713468000         1.08%  ...               52       4299439000  56%
 69  2020  7795000000         1.05%  ...               52       4378900000  56%

 [70 rows x 7 columns],
                      Region  1500  1600  1700  ...  2010  2012  2050  2150
 0                     World   585   660   710  ...  6896  7052  9725  9746
 1                    Africa    86   114   106  ...  1022  1052  2478  2308
 2                      Asia   282   350   411  ...  4164  4250  5267  5561
 3                    Europe   168   170   178  ...   738   740   734   517
 4     Latin America[Note 1]    40    20    10  ...   590   603   784   912
 5  Northern America[Note 1]     6     3     2  ...   345   351   433   398
 6                   Oceania     3     3     3  ...    37    38    57    51

 [7 rows x 15 columns],
                      Region  1500  1600  1700  ...  2010  2012  2050  2150
 0                    Africa  14.7  17.3  14.9  ...  14.8  15.2  25.5  23.7
 1                      Asia  48.2  53.0  57.9  ...  60.4  60.3  54.2  57.1
 2                    Europe  28.7  25.8  25.1  ...  10.7  10.5   7.6   5.3
 3     Latin America[Note 1]   6.8   3.0   1.4  ...   8.6   8.6   8.1   9.4
 4  Northern America[Note 1]   1.0   0.5   0.3  ...   5.0   5.0   4.5   4.1
 5                   Oceania   0.5   0.5   0.4  ...   0.5   0.5   0.6   0.5

 [6 rows x 15 columns],
          Year    World  ...  Oceania              Notes
 0   70,000 BC  < 0.015  ...      NaN              [116]
 1   10,000 BC        4  ...      NaN              [117]
 2     8000 BC        5  ...      NaN                NaN
 3     6500 BC        5  ...      NaN                NaN
 4     5000 BC        5  ...      NaN                NaN
 5     4000 BC        7  ...      NaN                NaN
 6     3000 BC       14  ...      NaN                NaN
 7     2000 BC       27  ...      NaN                NaN
 8     1000 BC       50  ...      NaN  [citation needed]
 9      500 BC      100  ...      NaN                NaN
 10       AD 1      200  ...      NaN                NaN
 11       1000      400  ...      2.0                NaN
 12       1500      458  ...      3.0                NaN
 13       1600      580  ...      3.0                NaN
 14       1700      682  ...      3.0                NaN
 15       1750      791  ...      2.0                NaN
 16       1800     1000  ...      3.0                NaN
 17       1850     1262  ...      2.0                NaN
 18       1900     1650  ...      6.0                NaN
 19       1950     2525  ...     12.7              [118]
 20       1955     2758  ...     14.2                NaN
 21       1960     3018  ...     15.8                NaN
 22       1965     3322  ...     17.5                NaN
 23       1970     3682  ...     19.7                NaN
 24       1975     4061  ...     21.5                NaN
 25       1980     4440  ...     23.0                NaN
 26       1985     4853  ...     24.9                NaN
 27       1990     5310  ...     27.0                NaN
 28       1995     5735  ...     29.1                NaN
 29       2000     6127  ...     31.1                NaN
 30       2005     6520  ...     33.4                NaN
 31       2010     6930  ...     36.4                NaN
 32       2015     7349  ...     39.3                NaN

 [33 rows x 9 columns],
     0                                                  1
 0 NaN  This section needs additional citations for ve...,
    Year  UN est.(millions) Difference  USCB est.(millions) Difference.1
 0  2005               6542          –                 6473            –
 1  2010               6957        415                 6866          393
 2  2015               7380        423                 7256          390
 3  2020               7795        415                 7643          380
 4  2025               8184        390                 8007          363
 5  2030               8549        364                 8341          334
 6  2035               8888        339                 8646          306
 7  2040               9199        311                 8926          280
 8  2045               9482        283                 9180          254
 9  2050               9735        253                 9408          228,
     Year  World  ... Northern America    Oceania
 0   2000   6144  ...       312 (5.1%)  31 (0.5%)
 1   2005   6542  ...       327 (5.0%)  34 (0.5%)
 2   2010   6957  ...       343 (4.9%)  37 (0.5%)
 3   2015   7380  ...       357 (4.8%)  40 (0.5%)
 4   2020   7795  ...       369 (4.7%)  43 (0.6%)
 5   2025   8184  ...       380 (4.6%)  45 (0.6%)
 6   2030   8549  ...       391 (4.6%)  48 (0.6%)
 7   2035   8888  ...       401 (4.5%)  50 (0.6%)
 8   2040   9199  ...       410 (4.5%)  53 (0.6%)
 9   2045   9482  ...       418 (4.4%)  55 (0.6%)
 10  2050   9735  ...       425 (4.4%)  57 (0.6%)
 11  2055   9958  ...       432 (4.3%)  60 (0.6%)
 12  2060  10152  ...       439 (4.3%)  62 (0.6%)
 13  2065  10318  ...       447 (4.3%)  64 (0.6%)
 14  2070  10459  ...       454 (4.3%)  66 (0.6%)
 15  2075  10577  ...       461 (4.4%)  67 (0.6%)
 16  2080  10674  ...       468 (4.4%)  69 (0.7%)
 17  2085  10750  ...       474 (4.4%)  71 (0.7%)
 18  2090  10810  ...       479 (4.4%)  72 (0.7%)
 19  2095  10852  ...       485 (4.5%)  74 (0.7%)
 20  2100  10875  ...       491 (4.5%)  75 (0.7%)

 [21 rows x 8 columns],
   Population(in billions)            0.5  0.5.1     1  ...     4   4.1     8     8.1
 0                    Year           1500   1500  1804  ...  1974  1974  2024  2024.0
 1           Years elapsed  Years elapsed    304   304  ...    47    50    50     NaN

 [2 rows x 11 columns],
   Population(in billions)          0.375  0.375.1  ...   3.1     6     6.1
 0                    Year           1171     1171  ...  1960  1999  1999.0
 1           Years elapsed  Years elapsed      544  ...    39    39     NaN

 [2 rows x 11 columns],
     0                                                  1
 0 NaN  Wikimedia Commons has media related to World p...,
   .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:"[ "}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:" ]"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}.mw-parser-output .infobox .navbar{font-size:100%}.mw-parser-output .navbox .navbar{display:block;font-size:100%}.mw-parser-output .navbox-title .navbar{float:left;text-align:left;margin-right:0.5em}vteGlobal human population .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:"[ "}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:" ]"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}.mw-parser-output .infobox .navbar{font-size:100%}.mw-parser-output .navbox .navbar{display:block;font-size:100%}.mw-parser-output .navbox-title .navbar{float:left;text-align:left;margin-right:0.5em}vteGlobal human population.1
 0                                       Major topics                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               Biocapacity Demographics of the world Human ov...
 1                       Biological andrelated topics                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               Population biology Population decline Populati...
 2                                  Populationecology                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               Earth's energy budget I = P × A × T Kaya ident...
 3                                         Literature                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               A Modest Proposal Observations Concerning the ...
 4                                       Publications                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               Population and Environment Population and Deve...
 5                                              Lists                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               Population and housing censuses by country Met...

In [ ]:
table = pd.read_html('wiki.html')
table

ValueError: ignored

In [ ]:
len(tables)

26

In [ ]:
tables[0]

        World population (millions, UN estimates)[14]  ...
                                                    #  ...                                            2030[A]
0                                                   1  ...                                               1416
1                                                   2  ...                                               1528
2                                                   3  ...                                                356
3                                                   4  ...                                                295
4                                                   5  ...                                                245
5                                                   6  ...                                                228
6                                                   7  ...                                                263
7                                                   8  ...                                                186
8                                                   9  ...                                                149
9                                                  10  ...                                                148
10                                                NaN  ...                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...  ...  Notes: .mw-parser-output .reflist{font-size:90...

[12 rows x 5 columns]

In [ ]:
tables[0].columns

MultiIndex([('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...)],
           )

In [ ]:
worldtopten = tables[0]
worldtopten = worldtopten['World population (millions, UN estimates)[14]']

In [ ]:
worldtopten

                                                    #  ...                                            2030[A]
0                                                   1  ...                                               1416
1                                                   2  ...                                               1528
2                                                   3  ...                                                356
3                                                   4  ...                                                295
4                                                   5  ...                                                245
5                                                   6  ...                                                228
6                                                   7  ...                                                263
7                                                   8  ...                                                186
8                                                   9  ...                                                149
9                                                  10  ...                                                148
10                                                NaN  ...                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...  ...  Notes: .mw-parser-output .reflist{font-size:90...

[12 rows x 5 columns]

In [ ]:
worldtopten = worldtopten.drop(11,axis=0)

In [ ]:
worldtopten = worldtopten.drop('#',axis=1)
worldtopten

   Top ten most populous countries  2000  2015 2030[A]
0                         China[B]  1270  1376    1416
1                            India  1053  1311    1528
2                    United States   283   322     356
3                        Indonesia   212   258     295
4                         Pakistan   136   208     245
5                           Brazil   176   206     228
6                          Nigeria   123   182     263
7                       Bangladesh   131   161     186
8                           Russia   146   146     149
9                           Mexico   103   127     148
10                     World total  6127  7349    8501

In [ ]:
worldtopten.columns = ['Country','2000','2015','2030 EST.']

In [ ]:
worldtopten

          Country  2000  2015 2030 EST.
0        China[B]  1270  1376      1416
1           India  1053  1311      1528
2   United States   283   322       356
3       Indonesia   212   258       295
4        Pakistan   136   208       245
5          Brazil   176   206       228
6         Nigeria   123   182       263
7      Bangladesh   131   161       186
8          Russia   146   146       149
9          Mexico   103   127       148
10    World total  6127  7349      8501

In [ ]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (1.4.25)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (1.1.2)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (4.8.1)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (3.6.0)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (3.7.4.3)

In [ ]:
from sqlalchemy import create_engine

In [ ]:
temp_tb = create_engine('sqlite:///:memory:')

In [ ]:
df = pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','c'])

In [ ]:
df.to_sql(name='new_table',con=temp_tb)

In [ ]:
new_df = pd.read_sql(sql='new_table',con=temp_tb)

In [ ]:
new_df

   index   a   b   c
0      0   9  77  20
1      1  37  85   5
2      2  76  40  64
3      3  87   2  83

In [ ]:
pd.read_sql_query(sql='SELECT a,c from new_table',con=temp_tb)

    a   c
0   9  20
1  37   5
2  76  64
3  87  83